In [28]:
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreySchafer@gmail.com", "JaneDoe@gmail.com", "JohnDoe@gmail.com"]
}

import pandas as pd
df = pd.DataFrame(people)
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [29]:
# Adding columns
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [30]:
df['full_name'] = df['first'] + ' ' + df['last']
df

   first     last                   email      full_name
0  Corey  Schafer  CoreySchafer@gmail.com  Corey Schafer
1   Jane      Doe       JaneDoe@gmail.com       Jane Doe
2   John      Doe       JohnDoe@gmail.com       John Doe

In [31]:
# Removing columns
df.drop(columns=['first', 'last'], inplace=True)

In [32]:
df

                    email      full_name
0  CoreySchafer@gmail.com  Corey Schafer
1       JaneDoe@gmail.com       Jane Doe
2       JohnDoe@gmail.com       John Doe

In [33]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [34]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [35]:
df

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@gmail.com       Jane Doe   Jane      Doe
2       JohnDoe@gmail.com       John Doe   John      Doe

In [36]:
# Adding rows
df.append({'first': 'Tony'}, ignore_index=True)

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@gmail.com       Jane Doe   Jane      Doe
2       JohnDoe@gmail.com       John Doe   John      Doe
3                     NaN            NaN   Tony      NaN

In [37]:
people2 = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Roger"],
    "email": ["IronMan@avenger.com", "Captain@avenger.com"]
}
df2 = pd.DataFrame(people2)
df2

   first   last                email
0   Tony  Stark  IronMan@avenger.com
1  Steve  Roger  Captain@avenger.com

In [38]:
df.append(df2, ignore_index=True, sort=True)

                    email  first      full_name     last
0  CoreySchafer@gmail.com  Corey  Corey Schafer  Schafer
1       JaneDoe@gmail.com   Jane       Jane Doe      Doe
2       JohnDoe@gmail.com   John       John Doe      Doe
3     IronMan@avenger.com   Tony            NaN    Stark
4     Captain@avenger.com  Steve            NaN    Roger

In [39]:
df = df.append(df2, ignore_index=True, sort=True)
df

                    email  first      full_name     last
0  CoreySchafer@gmail.com  Corey  Corey Schafer  Schafer
1       JaneDoe@gmail.com   Jane       Jane Doe      Doe
2       JohnDoe@gmail.com   John       John Doe      Doe
3     IronMan@avenger.com   Tony            NaN    Stark
4     Captain@avenger.com  Steve            NaN    Roger

In [40]:
df.drop(index=4)

                    email  first      full_name     last
0  CoreySchafer@gmail.com  Corey  Corey Schafer  Schafer
1       JaneDoe@gmail.com   Jane       Jane Doe      Doe
2       JohnDoe@gmail.com   John       John Doe      Doe
3     IronMan@avenger.com   Tony            NaN    Stark

In [42]:
filt = df['last'] == 'Doe'
df.drop(index = 
        df[filt].index)

                    email  first      full_name     last
0  CoreySchafer@gmail.com  Corey  Corey Schafer  Schafer
3     IronMan@avenger.com   Tony            NaN    Stark
4     Captain@avenger.com  Steve            NaN    Roger